code  =  int ( input ( 'Введите код города:' ))
min  =  int ( input ( 'Наблюдение количества минут:' ))

если  код  ==  343 :
    res  =  15 * мин
    print ( 'Екатеринбург, стоимость переговоров составляет -' , res , 'рублей' )
 Код  elif ==  381 :
    res  =  18 * мин
    print ( 'Омск, стоимость переговоров составляет -' , res , 'рублей' )
 Код  elif ==  473 :
    res  =  13 * мин
    print ( 'Воронеж, стоимость уступает -' , res , 'рублей' )
 Код  elif ==  485 :
    res  =  11 * мин
    print ( 'Ярославль, стоимость аренды составляет -' , res , 'рублей' )

"" "Программа рассчитывает стоимость для каждого города в зависимости от количества минут" ""
