s  =  "У лукоморья 123 дуб зеленый 456"

если  'я'  в  s :
    print ( 'Индекс буквы "я" -' , s . index ( "я" ))
еще :
    print ( 'В строке нет буквы "я"' )
"" "Определяет есть ли определенная буква в строке и выводит ее индекс" ""

у  =  с . счет ( 'у' )
print ( 'Количество букв "у" в строке -' , y )

"" "Определение количества определенных букв в строке" ""


если  s . isalpha () ==  Ложь :
    печать ( s . upper ())
еще :
    print ( 'В строке только буквы' )

"" "Определяет последовательность строк только из букв и если нет вывода строки в верхнем регистре" ""

если  len ( s ) >  4 :
    печать ( s . lower ())

"" "Определяет длину строки и если она больше 4 выводит ее в нижнем регистре" ""

print ( 'О' , s [ 1 :])

"" "Заменяет первый символ в строке на другую букву и выводит результат на экран" ""
